# IfcApplicationVersion Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..IfcApplicationVersion Property
ParameterTypeId Class See Also
---
"IfcApplicationVersion"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId IfcApplicationVersion { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property IfcApplicationVersion As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ IfcApplicationVersion {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace